In [26]:
import pandas as pd

In [27]:
a=pd.Series(["Sita","Rita","Ram","Hari"])
b=pd.Series([1000,2500,4000,2200])

In [28]:
df=pd.DataFrame({"Name":a,"Salary":b})

In [29]:
df

   Name  Salary
0  Sita    1000
1  Rita    2500
2   Ram    4000
3  Hari    2200

In [30]:
df[df["Salary"]==4000]

  Name  Salary
2  Ram    4000

In [31]:
df[~(df["Salary"]==4000)]

   Name  Salary
0  Sita    1000
1  Rita    2500
3  Hari    2200

In [32]:
df[df.Salary>2000]

   Name  Salary
1  Rita    2500
2   Ram    4000
3  Hari    2200

# Getting

In [33]:
df["Salary"]

0    1000
1    2500
2    4000
3    2200
Name: Salary, dtype: int64

In [34]:
df.Salary

0    1000
1    2500
2    4000
3    2200
Name: Salary, dtype: int64

In [35]:
df.iloc(1)

# Setting

In [36]:
df

   Name  Salary
0  Sita    1000
1  Rita    2500
2   Ram    4000
3  Hari    2200

In [37]:
df["Salary"]=[2000,3000,4000,1000]

In [38]:
df

   Name  Salary
0  Sita    2000
1  Rita    3000
2   Ram    4000
3  Hari    1000

# Delete

In [39]:
del df["Salary"]

In [40]:
df

   Name
0  Sita
1  Rita
2   Ram
3  Hari